CS142/project4/app/views/users/show.html.erb

SELECT "users".* FROM "users" WHERE "users"."id" = ? ORDER BY "users"."id" ASC LIMIT 1  [["id", 2]]
---
  <% for c in p.comments %>
    <p class = "commentInfo"><%= c.date_time %> <a href = "<%= c.user.id%>"><%= c.user.first_name %> <%= c.user.last_name %></a>:</p>