CS142/project5/app/controllers/photos_controller.rb

INSERT INTO "photos" ("date_time", "file_name", "user_id") VALUES (?, ?, ?)  [["date_time", Wed, 14 May 2014], ["file_name", "Screen Shot 2014-05-12 at 12.35.01 AM.png"], ["user_id", 3]]
---
  def create
    if !params[:photo].nil?
      name = params[:photo][:uploadedPhoto].original_filename
      directory = "app/assets/images"
      path = Rails.root.join(directory, name)
      File.open(path, "wb") do |f|
        f.write(params[:photo][:uploadedPhoto].read)
      end
      newphoto = Photo.new
      newphoto.user_id = session[:log].id
      newphoto.date_time = DateTime.now
      newphoto.file_name = name
      newphoto.save()